{
  "backend/main.mo": "Main actor implementing team management, user profiles, mail system, battle requests, and team footage uploads with authorization mixins and blob storage integration.",
  "backend/migration.mo": "Migration module defining data types and a pass-through migration function that preserves all state between actor upgrades.",
  "feature_evidence.json": "Feature evidence report identifying three high-confidence issues related to infinite recursion/circular dependencies in React Query hooks and TeamDetailPage component.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files documenting React Query hooks with scoped invalidation, stable callbacks, responsive UI components, and proper dependency management to prevent infinite loops.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH-based color system, dark mode support, and custom CSS variables for tournament-themed design.",
  "frontend/index.html": "HTML entry point with dark mode class, viewport meta tags, SEO metadata, and Open Graph tags for Beyblade X Teams application.",
  "frontend/src/App.tsx": "Root application component with hash-based routing, team ID extraction, profile setup modal with proper loading checks, and conditional page rendering based on authentication state.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button that uses Internet Identity authentication, handles login state transitions, and clears the query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Displays a modal dialog for new users to enter their name during initial profile setup, saving the profile via mutation hook.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches rendering errors and displays a fallback UI with error details and recovery options.",
  "frontend/src/components/files/PdfList.tsx": "Empty placeholder file; PDF list functionality has been replaced with team footage gallery.",
  "frontend/src/components/files/PdfUploader.tsx": "Empty placeholder file; PDF upload functionality has been replaced with team footage uploads.",
  "frontend/src/components/layout/AppHeader.tsx": "Main application header with navigation links (Home, Teams, Create Team, My Teams, Inbox, Profile), login button, unread inbox badge, and responsive mobile menu.",
  "frontend/src/components/layout/PageShell.tsx": "Reusable page layout wrapper component that provides consistent max-width container, optional title, and description sections.",
  "frontend/src/components/profile/ProfilePictureUploader.tsx": "File upload component for profile pictures with preview, validation (PNG/JPG/WebP, max 2MB), and conversion to ExternalBlob format.",
  "frontend/src/components/teams/BattleRequestDialog.tsx": "Modal dialog for creating battle requests between teams, allowing users to select a proposed battle date via calendar picker.",
  "frontend/src/components/teams/BattleRequestList.tsx": "Displays incoming pending battle requests for a team with accept/reject buttons, showing requesting team name and proposed date.",
  "frontend/src/components/teams/JoinRequestButton.tsx": "Button component for requesting to join a team, with validation to prevent joining multiple teams and feedback for request status.",
  "frontend/src/components/teams/ScheduledBattlesList.tsx": "Displays a list of scheduled (accepted) battles for a team, sorted by date, showing opponent names and confirmation badges. Includes loading states and empty state handling.",
  "frontend/src/components/teams/TeamFootageGallery.tsx": "Renders a gallery of team footage videos with delete functionality for team leaders. Displays videos with team avatars and includes confirmation dialogs for deletion.",
  "frontend/src/components/teams/TeamFootageUploader.tsx": "Handles video file uploads for team footage with validation (max 100MB, video formats only), progress tracking, and error handling using ExternalBlob.",
  "frontend/src/components/teams/TeamIconUploader.tsx": "Manages team icon image uploads with preview, validation (PNG/JPG/WebP, max 2MB), and clear functionality. Supports both new uploads and displaying existing icons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, handling both anonymous and authenticated states. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides hooks to fetch the current user's profile and role from the backend actor with caching and loading state management.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider, managing login/logout flows, identity persistence, and delegation validation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API operations including user profiles, teams, team membership, mail/inbox, battle requests, and file uploads (team icons, footage). Includes mutations with toast notifications and query invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (primary, secondary, accent, destructive, etc.) and base styles for HTML elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/CreateTeamPage.tsx": "Page component for creating a new team with name input and optional icon upload. Validates user authentication and existing team membership before allowing team creation.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section and feature cards showcasing the app's main functionality: building teams, uploading footage, and connecting with the Beyblade X community.",
  "frontend/src/pages/InboxPage.tsx": "Inbox page displaying user messages with mail list and detail view. Handles marking messages as read, deleting messages, and approving/denying team join requests.",
  "frontend/src/pages/LeaderDashboardPage.tsx": "Dashboard for team leaders showing their teams overview and pending join requests. Includes battle request management component and navigation to team detail pages.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page component that displays and allows editing of user profile information including name, about me, profile picture, and team membership details with leader/member-specific actions.",
  "frontend/src/pages/TeamDetailPage.tsx": "Team detail page component that displays team information, member list, footage gallery, and battle management features with role-based permissions using stable memoized values to prevent infinite loops.",
  "frontend/src/pages/TeamListPage.tsx": "Team list page component that displays a grid of all teams with their icons, member counts, and navigation to individual team detail pages.",
  "frontend/src/utils/imageDataUrl.ts": "Utility functions for converting image byte arrays and content types into data URLs for rendering, supporting both object URLs and base64 encoding.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, container settings, border radius variables, font families, and animation keyframes.",
  "project_state.json": "Project state metadata tracking the current fix request for resolving a maximum call stack size exceeded error, with focus on circular dependencies in React Query hooks and TeamDetailPage useMemo dependencies."
}