{
  "backend/main.mo": "Main backend actor implementing user profiles, team management (with members, join requests, files, icons, videos), mail system, battle requests, and authorization mixins for access control and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: updating the website title and user-facing text from \"Beyblade X Teams\" to \"The X\" in frontend files.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing components, hooks, pages, utilities, and their responsive/mobile-optimized implementations.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH-based color system defining light and dark theme variables for backgrounds, foregrounds, borders, and component colors.",
  "frontend/index.html": "HTML entry point with \"The X\" title, meta tags for SEO/social sharing, dark mode class, and viewport configuration for mobile responsiveness.",
  "frontend/src/App.tsx": "Main React app component with hash-based routing, authentication state management, profile setup modal logic, and conditional page rendering based on current route.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component using Internet Identity with query cache clearing on logout and stable callback handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup requiring name input with controlled state and mutation handling.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches rendering errors and displays a fallback UI with error details and recovery options.",
  "frontend/src/components/files/PdfList.tsx": "Empty placeholder file indicating PDF list functionality has been replaced with team footage gallery.",
  "frontend/src/components/files/PdfUploader.tsx": "Empty placeholder file indicating PDF upload functionality has been replaced with team footage uploads.",
  "frontend/src/components/layout/AppHeader.tsx": "Main application header with navigation menu, authentication status, and inbox notifications. Includes responsive mobile menu with hamburger toggle.",
  "frontend/src/components/layout/PageShell.tsx": "Reusable page layout wrapper component that provides consistent container width, optional title/description header, and configurable max-width constraints.",
  "frontend/src/components/profile/ProfilePictureUploader.tsx": "Profile picture upload component with image preview, file validation (type/size), and conversion to ExternalBlob format for backend storage.",
  "frontend/src/components/teams/BattleRequestDialog.tsx": "Modal dialog for creating battle requests between teams with date picker for proposing battle dates.",
  "frontend/src/components/teams/BattleRequestList.tsx": "Displays incoming pending battle requests for a team with accept/reject actions for team leaders.",
  "frontend/src/components/teams/JoinRequestButton.tsx": "Button component for requesting to join a team, with validation to prevent joining multiple teams and handling of team capacity limits.",
  "frontend/src/components/teams/ScheduledBattlesList.tsx": "Displays accepted/scheduled battles for a team, sorted by date, showing opponent names and battle dates.",
  "frontend/src/components/teams/TeamFootageGallery.tsx": "Displays a gallery of team footage videos with delete functionality for team leaders, showing team avatars, video players, and confirmation dialogs for deletion.",
  "frontend/src/components/teams/TeamFootageUploader.tsx": "Provides a file upload interface for team footage videos with validation (max 100MB), progress tracking, and error handling using ExternalBlob for upload.",
  "frontend/src/components/teams/TeamIconUploader.tsx": "Handles team icon image uploads with preview, validation (PNG/JPG/WebP, max 2MB), and displays current icon with option to clear selection.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides React Query hooks to fetch the current user's profile and role from the backend actor with caching and refetch configuration.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider, managing login state, identity persistence, and delegation validation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, team management, team membership, footage uploads/deletes, and battle requests with toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (primary, secondary, accent, destructive, etc.) and chart colors. Includes base styles for smooth scrolling, touch interactions, and accessibility.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/CreateTeamPage.tsx": "Page for creating a new Beyblade X team with name input and optional icon upload. Validates user authentication, checks if user is already in a team, and navigates to the new team's detail page upon successful creation.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section showcasing Beyblade X team features, navigation buttons to browse/create teams, and feature cards highlighting team building, video uploads, and community connection.",
  "frontend/src/pages/InboxPage.tsx": "Inbox page displaying user messages with read/unread status, supporting actions like marking as read, deleting, and handling team join request approvals/denials. Shows message list and selected message detail view.",
  "frontend/src/pages/LeaderDashboardPage.tsx": "Dashboard for team leaders to manage their teams, view join requests, and handle battle requests. Displays overview of all teams the user leads with member counts and pending request badges.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page with editable name, about me section, and profile picture upload. Shows team membership status, allows team leaders to disband teams, and regular members to leave teams.",
  "frontend/src/pages/TeamDetailPage.tsx": "Displays detailed team information including members, leader status, team icon, footage gallery, battle requests, and scheduled battles. Provides team management actions (disband, leave, remove members) and battle initiation for authorized users.",
  "frontend/src/pages/TeamListPage.tsx": "Displays a grid of all teams with their icons, names, and member counts. Allows navigation to individual team detail pages and shows a create team prompt when no teams exist.",
  "frontend/src/utils/imageDataUrl.ts": "Provides utility functions to convert image byte arrays and content types into data URLs (blob URLs or base64) for rendering in the browser.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system with OKLCH color tokens, custom animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking completed features to rebrand the application from \"Beyblade X Teams\" to \"The X\" across the website title and user-facing text."
}