{
  "backend/main.mo": "Main Motoko actor implementing user profiles, team management (create, join, leave), mail/inbox system, file/video storage with blob integration, and role-based access control with admin and user permissions.",
  "feature_evidence.json": "Feature evidence report documenting five mobile responsiveness features (hero/cards, header navigation, team pages, forms/modals, inbox/dashboard) with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing mobile-responsive implementations, React Query hooks, authentication flows, and component-level responsive design patterns.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system for light/dark themes, custom CSS variables for design tokens, and base styling for body and border elements.",
  "frontend/index.html": "HTML entry point with viewport meta tags for mobile responsiveness, Open Graph and Twitter Card metadata for social sharing, and root div for React mounting.",
  "frontend/src/App.tsx": "Main React app component with hash-based routing, Internet Identity authentication, profile setup modal trigger logic, and page rendering for all routes with theme provider.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component using Internet Identity with query cache clearing on logout, loading states, and icon-based UI with Lucide icons.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup with responsive sizing (max-w-xs on mobile, max-w-md on desktop), name input field, and mutation-based profile saving with loading states.",
  "frontend/src/components/files/PdfList.tsx": "Empty placeholder file indicating PDF list functionality has been replaced with team footage gallery.",
  "frontend/src/components/files/PdfUploader.tsx": "Empty placeholder file indicating PDF upload functionality has been replaced with team footage uploads.",
  "frontend/src/components/layout/AppHeader.tsx": "Main application header component with navigation menu, logo, authentication controls, and mobile responsive menu with hamburger toggle. Displays unread inbox count badge and routes to various pages (home, teams, create team, leader dashboard, inbox).",
  "frontend/src/components/layout/PageShell.tsx": "Reusable page layout wrapper component that provides consistent container width, optional title and description header, and configurable max-width constraints (sm to full).",
  "frontend/src/components/teams/JoinRequestButton.tsx": "Button component for requesting to join a team, with logic to prevent joining multiple teams, show loading states, and display success/error alerts. Handles team capacity limits (max 3 members).",
  "frontend/src/components/teams/TeamFootageGallery.tsx": "Displays a responsive grid gallery of team video footage with loading skeletons and empty state. Renders video elements with controls using ExternalBlob URLs.",
  "frontend/src/components/teams/TeamFootageUploader.tsx": "File upload component for team video footage with progress tracking, file validation (video types only), and upload status feedback. Converts files to Uint8Array and uses ExternalBlob for upload with progress callbacks.",
  "frontend/src/components/teams/TeamIconUploader.tsx": "Image file uploader for team icons with preview, validation (PNG/JPG/WebP, max 2MB), and clear functionality. Converts uploaded images to Uint8Array and displays current or preview icon.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides React Query hooks for fetching the current authenticated user's profile and role from the backend actor. Handles loading states and depends on actor availability.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend operations including user profiles, team management (create, join, approve requests), team membership status, and file uploads with toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, border radius, and chart colors, plus base styles for smooth scrolling and accessibility.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/CreateTeamPage.tsx": "Page component for creating a new team with name input and optional icon upload, enforcing single-team membership and requiring authentication.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section and feature cards showcasing Beyblade X team building, video sharing, and community features with navigation to teams and team creation.",
  "frontend/src/pages/InboxPage.tsx": "Inbox page displaying mail messages with support for marking as read, deleting, and handling team join requests with approve/deny actions.",
  "frontend/src/pages/LeaderDashboardPage.tsx": "Leader dashboard page that displays teams owned by the authenticated user, shows join requests, and provides navigation to team details and creation. Includes loading states, empty states, and responsive card layouts.",
  "frontend/src/pages/TeamDetailPage.tsx": "Team detail page showing team information, members, icon upload, footage gallery, and join request functionality. Includes leader-only actions like disbanding teams and managing uploads with loading/error states.",
  "frontend/src/pages/TeamListPage.tsx": "Public team list page displaying all teams in a responsive grid with team icons, member counts, and navigation to individual team details. Includes loading and empty states.",
  "frontend/src/utils/imageDataUrl.ts": "Utility functions to convert image byte arrays and content types into data URLs (blob URLs and base64) for rendering images in the browser.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from both regular URLs and hash-based routing, with sessionStorage persistence support and parameter cleanup functions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, container settings, extended theme with animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document listing six completed mobile-responsive features (hero section, header, team pages, forms, inbox/dashboard, viewport/touch) and one pending feature request for mobile accessibility."
}