{
  "backend/main.mo": "Main actor implementing team management, user profiles, mail/inbox, battle requests, and team footage with authorization controls, blob storage integration, and migration support.",
  "backend/migration.mo": "Migration module defining OldActor and NewActor types with a run function that preserves all state during canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: profile picture display, battle request initiation UI, battle request response UI, and scheduled battles display.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend source files including components, pages, hooks, and utilities with mobile-responsive and battle request functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, and component colors.",
  "frontend/index.html": "HTML entry point with viewport meta tags, Open Graph and Twitter Card metadata for social sharing, and root div for React mounting.",
  "frontend/src/App.tsx": "Main React app component with hash-based routing, authentication state management, profile setup modal, and page rendering for all routes including home, teams, inbox, and profile.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component using Internet Identity with query cache clearing on logout and error handling for authentication state.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name on first login, using a form with validation and mutation hook to save the profile.",
  "frontend/src/components/files/PdfList.tsx": "Empty placeholder file indicating PDF list functionality has been replaced with team footage gallery.",
  "frontend/src/components/files/PdfUploader.tsx": "Empty placeholder file indicating PDF upload functionality has been replaced with team footage uploads.",
  "frontend/src/components/layout/AppHeader.tsx": "Main application header with logo, navigation menu (Home, Teams, Create Team, My Teams, Inbox, Profile), authentication button, and responsive mobile menu with unread inbox badge.",
  "frontend/src/components/layout/PageShell.tsx": "Reusable page layout wrapper component that provides consistent container width, optional title/description header, and configurable max-width constraints.",
  "frontend/src/components/profile/ProfilePictureUploader.tsx": "File upload component for profile pictures with image preview, validation (PNG/JPG/WebP, max 2MB), and conversion to ExternalBlob format.",
  "frontend/src/components/teams/BattleRequestDialog.tsx": "Dialog for creating battle requests between teams, featuring a date picker for proposed battle dates and mutation hook to submit requests.",
  "frontend/src/components/teams/BattleRequestList.tsx": "Displays incoming pending battle requests for a team with accept/reject buttons, showing requesting team name and proposed date.",
  "frontend/src/components/teams/JoinRequestButton.tsx": "Button component for requesting to join a team, with logic to prevent joining multiple teams and show appropriate states (loading, sent, already on team, team full).",
  "frontend/src/components/teams/ScheduledBattlesList.tsx": "Displays a list of scheduled (accepted) battles for a team, showing opponent names and proposed dates sorted chronologically. Includes loading states and empty state handling.",
  "frontend/src/components/teams/TeamFootageGallery.tsx": "Renders a gallery of team footage videos with delete functionality for team leaders and members. Shows video cards with team icons and handles loading/empty states.",
  "frontend/src/components/teams/TeamFootageUploader.tsx": "Provides a file input component for uploading team footage videos with validation (max 100MB, video formats only) and progress tracking. Converts files to ExternalBlob format for backend upload.",
  "frontend/src/components/teams/TeamIconUploader.tsx": "File upload component for team icons with image preview, validation (PNG/JPG/WebP, max 2MB), and clear functionality. Supports both new uploads and displaying existing icons.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides hooks to fetch the current user's profile and role from the backend using the actor. Handles loading states and actor availability.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle. Includes status tracking and error handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for managing user profiles, teams, team membership, join requests, mail/inbox, battle requests, and file uploads (team icons, footage, external blobs) with mutations and queries that interact with the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (primary, secondary, accent, destructive, etc.) and base styles for smooth scrolling and accessibility.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/CreateTeamPage.tsx": "Page component for creating a new team with name input and optional icon upload, validates user authentication and existing team membership, then navigates to the newly created team detail page on success.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section showcasing Bey Hub X features, displaying cards for team building, footage uploads, and community connection with navigation buttons to browse or create teams.",
  "frontend/src/pages/InboxPage.tsx": "Inbox page displaying mail messages with a list/detail view, supporting marking as read, deleting messages, and approving/denying team join requests with loading and authentication states.",
  "frontend/src/pages/LeaderDashboardPage.tsx": "Dashboard for team leaders showing their teams, pending join requests, and battle requests with navigation to team details and request management functionality.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page component that displays and allows editing of user profile information including name, about me text, and profile picture with upload functionality. Handles authentication checks, loading states, and profile save mutations.",
  "frontend/src/pages/TeamDetailPage.tsx": "Team detail page showing team information, members, footage gallery, and scheduled battles. Provides team management actions (disband, leave, remove members) for leaders and includes battle request dialog and join request functionality.",
  "frontend/src/pages/TeamListPage.tsx": "Displays a grid of all teams with their icons, names, and member counts. Provides navigation to individual team detail pages and prompts to create a team if none exist.",
  "frontend/src/utils/imageDataUrl.ts": "Utility functions to convert image byte arrays and content types into data URLs for rendering, supporting both object URL and base64 encoding methods.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, custom fonts, and animation keyframes for accordion components.",
  "project_state.json": "Project state tracking document for a Beyblade team management app, listing existing features (profile pictures, battle scheduling UI) and pending feature requests for backend battle request system implementation."
}