{
  "backend/main.mo": "Motoko backend implementing user profiles, team management, access control, mail notifications, and blob storage integration.",
  "feature_evidence.json": "Feature evidence report mapping frontend file changes to feature IDs, components, and test requirements.",
  "frontend-file-summaries.txt": "JSON-like text providing short summaries of all frontend source files for reference.",
  "frontend/index.css": "Tailwind-based global styling defining color variables, light/dark themes, and base element rules.",
  "frontend/index.html": "Frontend HTML entry point with basic metadata and script loader without domain-specific URLs.",
  "frontend/src/App.tsx": "Main React app with hash-based routing, authentication state, profile modal, and page rendering.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal shown on first login allowing users to save their display name.",
  "frontend/src/components/files/PdfList.tsx": "Empty placeholder replacing removed PDF list feature.",
  "frontend/src/components/files/PdfUploader.tsx": "Empty placeholder replacing removed PDF upload feature.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with branding, navigation, login controls, and unread inbox badge.",
  "frontend/src/components/layout/PageShell.tsx": "Provides a page container with optional title/description and configurable max-width layout.",
  "frontend/src/components/teams/JoinRequestButton.tsx": "Renders a join-team button with logic for authentication, membership status, pending requests, and team limits.",
  "frontend/src/components/teams/TeamFootageGallery.tsx": "Displays team video footage with loading skeletons or an empty-state message when no videos exist.",
  "frontend/src/components/teams/TeamFootageUploader.tsx": "Handles video file selection, validation, progress tracking, and upload of team footage.",
  "frontend/src/components/teams/TeamIconUploader.tsx": "Allows selecting, previewing, validating, and clearing an image file for a team icon.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides queries for the caller's user profile and role using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state, login, and logout functionality.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for team membership, team CRUD, join requests, inbox actions, and related mutations with cache invalidation and toast feedback.",
  "frontend/src/index.css": "Configures Tailwind base layers and CSS variables for light/dark themes along with global styling utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/CreateTeamPage.tsx": "UI for creating a team, handling name input, optional icon upload, membership checks, and navigation after creation.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero content, navigation buttons, and feature cards based on authentication state.",
  "frontend/src/pages/InboxPage.tsx": "Displays user inbox with mail selection, read/delete actions, and approving or denying join requests.",
  "frontend/src/pages/LeaderDashboardPage.tsx": "Shows teams led by the user, highlighting pending join requests and providing navigation to team details.",
  "frontend/src/pages/TeamDetailPage.tsx": "Team detail view that loads team data, handles icon upload, footage display, join requests, and allows leaders to disband the team.",
  "frontend/src/pages/TeamListPage.tsx": "Displays a grid of all teams with icons, member counts, and navigation to each team’s detail page.",
  "frontend/src/utils/imageDataUrl.ts": "Utility functions converting raw image bytes to object URLs or base64 data URLs for rendering.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using both query strings and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and layout with custom theme settings and plugins.",
  "project_state.json": "Project metadata describing current features, requirements, issues, and architectural notes for the Bey Hub X app."
}