{
  "backend/main.mo": "Main backend actor implementing user profiles, team management (with members, join requests, files, icons, videos), mailbox system, battle requests, and authorization mixins for access control and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting the replacement of text-based logo with custom Beyblade X image in AppHeader component with high confidence.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files covering routing, React Query hooks, authentication, profile setup, team management, and responsive UI components for the Beyblade X tournament application.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH-based color system defining light and dark mode CSS variables for the Beyblade X tournament theme.",
  "frontend/index.html": "HTML entry point with viewport meta tags, SEO metadata, and Open Graph tags for \"Bey Hub X\" Beyblade battle team management application.",
  "frontend/src/App.tsx": "Main app component with hash-based routing, profile setup modal for new users, authentication state management, and footer with caffeine.ai attribution.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button with stable callback using useCallback, query cache clearing on logout, and disabled state during authentication.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for new users to enter their name on first login, with controlled input state and mutation handling.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches rendering errors and displays a fallback UI with error details and recovery options.",
  "frontend/src/components/files/PdfList.tsx": "Empty placeholder file as PDF list functionality has been replaced with team footage gallery.",
  "frontend/src/components/files/PdfUploader.tsx": "Empty placeholder file as PDF upload functionality has been replaced with team footage uploads.",
  "frontend/src/components/layout/AppHeader.tsx": "Main application header with navigation menu, logo, authentication controls, theme toggle, and inbox notification badge. Includes responsive mobile menu with hamburger toggle.",
  "frontend/src/components/layout/PageShell.tsx": "Reusable page layout wrapper component that provides consistent container width, optional title/description header, and configurable max-width constraints.",
  "frontend/src/components/profile/ProfilePictureUploader.tsx": "Profile picture upload component with file validation (PNG/JPG/WebP, max 2MB), preview display using Avatar component, and conversion to ExternalBlob format for backend storage.",
  "frontend/src/components/teams/BattleRequestDialog.tsx": "Modal dialog for creating battle requests between teams, featuring a date picker for proposing battle dates and mutation handling for request submission.",
  "frontend/src/components/teams/BattleRequestList.tsx": "Displays incoming pending battle requests for a team with accept/reject actions, showing requesting team name and proposed date with responsive layout.",
  "frontend/src/components/teams/JoinRequestButton.tsx": "Button component for requesting to join a team, with validation to prevent joining multiple teams and display of team membership status.",
  "frontend/src/components/teams/ScheduledBattlesList.tsx": "Lists accepted battle requests for a team sorted by date, displaying opponent team names and battle dates with empty state handling.",
  "frontend/src/components/teams/TeamFootageGallery.tsx": "Displays a gallery of team footage videos with delete functionality for team leaders, showing team avatars, video players, and empty states when no footage exists.",
  "frontend/src/components/teams/TeamFootageUploader.tsx": "Provides a file input component for uploading team footage videos with validation (max 100MB), progress tracking, and error handling using ExternalBlob.",
  "frontend/src/components/teams/TeamIconUploader.tsx": "Handles team icon image uploads with preview, validation (PNG/JPG/WebP, max 2MB), and clear functionality, converting files to Uint8Array for backend storage.",
  "frontend/src/components/theme/ThemeToggle.tsx": "A button component that toggles between light and dark themes, displaying sun/moon icons based on the current theme state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with admin token and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides React Query hooks to fetch the current user's profile and role from the backend actor with caching and loading states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, teams, team membership, footage management, mail, and battle requests with mutation handling and cache invalidation.",
  "frontend/src/hooks/useTheme.ts": "Custom React hook that manages light/dark theme state, persists preference to localStorage, applies theme class to document root, and checks system preference on initial load.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color tokens for UI components (background, foreground, primary, secondary, etc.) and base styles for accessibility and smooth scrolling.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient and InternetIdentityProvider wrappers for state management and authentication.",
  "frontend/src/pages/CreateTeamPage.tsx": "Page component for creating a new Beyblade team with name input and optional icon upload; validates user authentication, checks existing team membership, and navigates to team detail page on success.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature cards highlighting team building and video uploads, and navigation buttons to browse or create teams.",
  "frontend/src/pages/InboxPage.tsx": "Inbox page displaying user messages with read/unread status, supporting actions like marking as read, deleting, and approving/denying team join requests.",
  "frontend/src/pages/LeaderDashboardPage.tsx": "Dashboard for team leaders showing owned teams, join requests, and battle requests with navigation to team detail pages and request management components.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page with editable name, about me section, and profile picture upload; displays team membership status and provides options for team leaders to disband or members to leave teams.",
  "frontend/src/pages/TeamDetailPage.tsx": "Displays detailed team information including members, leader status, footage gallery, battle requests, and provides actions like joining, leaving, disbanding, uploading footage, and initiating battles based on user permissions.",
  "frontend/src/pages/TeamListPage.tsx": "Renders a grid of all teams with their icons, names, member counts, and navigation to individual team detail pages; shows skeleton loaders during data fetch and empty state when no teams exist.",
  "frontend/src/utils/imageDataUrl.ts": "Provides utility functions to convert image byte arrays and content types into data URLs (both object URLs and base64-encoded) for rendering images in the browser.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, font families, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata tracking architectural notes, known issues, features, and requirements; includes a pending feature request to replace text-based logo with custom Beyblade X image in the header."
}