{
  "backend/main.mo": "Main actor defining user profiles, teams with videos/files/icons, mail system for join requests, battle requests, and access control integration with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: debugging the 'Actor not available' error in CreateTeamPage and adding error boundary/loading state handling to prevent premature mutations.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including hooks with 30-second staleTime, stable callbacks, proper actor dependency handling, and mobile-optimized responsive components.",
  "frontend/index.css": "Global Tailwind styles with OKLCH-based color system defining light and dark mode CSS variables for the Beyblade X tournament theme.",
  "frontend/index.html": "HTML entry point with viewport meta tags, Bey Hub X branding, SEO meta tags, and script reference to main.tsx.",
  "frontend/src/App.tsx": "Main app component with hash-based routing, profile setup modal triggered when authenticated user has no profile, loading states, and footer with caffeine.ai attribution.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button with stable handleAuth callback using useCallback, proper query cache clearing on logout, and disabled state during authentication.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for new users to enter their name, with controlled input state and stable handleSave callback using useCallback.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches rendering errors and displays a fallback UI with error message and reload/home navigation options.",
  "frontend/src/components/files/PdfList.tsx": "Empty placeholder file as PDF list functionality has been replaced with team footage gallery.",
  "frontend/src/components/files/PdfUploader.tsx": "Empty placeholder file as PDF upload functionality has been replaced with team footage uploads.",
  "frontend/src/components/layout/AppHeader.tsx": "Main application header with navigation menu, authentication controls, theme toggle, and inbox notification badge. Includes responsive mobile menu with hamburger toggle.",
  "frontend/src/components/layout/PageShell.tsx": "Reusable page layout wrapper component that provides consistent container width, optional title/description header, and configurable max-width constraints.",
  "frontend/src/components/profile/ProfilePictureUploader.tsx": "Profile picture upload component with image preview, file validation (type/size), and avatar display. Converts uploaded files to ExternalBlob format for backend storage.",
  "frontend/src/components/teams/BattleRequestDialog.tsx": "Modal dialog for creating battle requests between teams with date picker for proposed battle date. Handles submission and validation of battle request creation.",
  "frontend/src/components/teams/BattleRequestList.tsx": "Displays incoming pending battle requests for a team with accept/reject actions. Shows requesting team name, proposed date, and handles response mutations.",
  "frontend/src/components/teams/JoinRequestButton.tsx": "Button component for requesting to join a team with validation logic preventing users from joining multiple teams. Shows appropriate states for loading, already-member, and request-sent.",
  "frontend/src/components/teams/ScheduledBattlesList.tsx": "Displays accepted/confirmed battle requests sorted by date. Shows opponent team name, battle date, and empty state when no battles are scheduled.",
  "frontend/src/components/teams/TeamFootageGallery.tsx": "Displays a gallery of team footage videos with delete functionality for team leaders, showing team avatar, video player, and confirmation dialog for deletion.",
  "frontend/src/components/teams/TeamFootageUploader.tsx": "Handles video file upload for team footage with validation (max 100MB), progress tracking, and error handling using ExternalBlob.",
  "frontend/src/components/teams/TeamIconUploader.tsx": "Manages team icon image upload with preview, validation (PNG/JPG/WebP, max 2MB), and clear functionality.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Provides a button component to toggle between light and dark themes using the useTheme hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides React Query hooks to fetch the current user's profile and role from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, teams, team membership, footage management, mail, and battle requests with toast notifications.",
  "frontend/src/hooks/useTheme.ts": "Custom React hook that manages light/dark theme state, persists preference to localStorage, applies theme class to document root, and checks system preference on initial load.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (background, foreground, primary, secondary, etc.) and base styles for accessibility and smooth scrolling.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient and InternetIdentityProvider wrappers for state management and authentication.",
  "frontend/src/pages/CreateTeamPage.tsx": "Page component for creating a new team with name input and optional icon upload; validates user authentication, checks existing team membership, creates team via mutation, and navigates to the new team detail page on success.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section featuring Beyblade X branding, call-to-action buttons for browsing and creating teams, and feature cards highlighting team building, video uploads, and community connection.",
  "frontend/src/pages/InboxPage.tsx": "Inbox page displaying user mail messages with read/unread status, delete functionality, and special handling for team join requests with approve/deny actions.",
  "frontend/src/pages/LeaderDashboardPage.tsx": "Dashboard for team leaders showing owned teams, join request counts, and a BattleRequestList component; prompts unauthenticated users to sign in and non-leaders to create a team.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page with editable name, about me text, and profile picture upload; displays team membership info and provides disband/leave team actions for team leaders/members.",
  "frontend/src/pages/TeamDetailPage.tsx": "Displays detailed team information including members, footage gallery, battle requests, and management actions. Implements role-based permissions for leaders and members with hooks for team data, icon/footage uploads, and team operations (disband, leave, remove members).",
  "frontend/src/pages/TeamListPage.tsx": "Displays a grid of all teams with their icons, names, and member counts. Uses useListTeams hook to fetch data and provides navigation to individual team detail pages.",
  "frontend/src/utils/imageDataUrl.ts": "Utility functions to convert image bytes and content type to data URLs (blob URL or base64) for rendering images in the browser.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting URL parameters from hash-based or query string routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, custom animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata tracking the 'Actor not available' error when creating teams, with existing features for debugging the error and adding error boundaries, plus a pending requirement to verify backend actor initialization."
}