{
  "backend/main.mo": "Motoko backend defining user profiles, team management, access control, mailboxes, and media storage with authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs for domain and metadata updates.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH color variables and dark mode overrides for the app theme.",
  "frontend/index.html": "Frontend HTML entry with domain redirect, canonical URL, and social metadata for beyhubx.com.",
  "frontend/src/App.tsx": "Main React app handling hash-based routing, authentication state, profile setup modal, and page rendering.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with error handling and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for creating a user profile with name input, save handling, and validation.",
  "frontend/src/components/files/PdfList.tsx": "Empty placeholder file replacing deprecated PDF list functionality.",
  "frontend/src/components/files/PdfUploader.tsx": "Empty placeholder file replacing deprecated PDF upload functionality.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation header that displays links, login button, and inbox badges based on authentication state.",
  "frontend/src/components/layout/PageShell.tsx": "Layout wrapper that constrains page width and optionally renders a title and description.",
  "frontend/src/components/teams/JoinRequestButton.tsx": "Renders a join-team button with conditional states based on user authentication, membership, and team status.",
  "frontend/src/components/teams/TeamFootageGallery.tsx": "Displays a grid of team video footage with loading skeletons and a fallback message when empty.",
  "frontend/src/components/teams/TeamFootageUploader.tsx": "Handles selecting, validating, and uploading video files with progress tracking for team footage.",
  "frontend/src/components/teams/TeamIconUploader.tsx": "Allows selecting, previewing, validating, and clearing team icon images with size/type checks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating queries when the actor changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides hooks to fetch the caller's user profile and role using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context and provider for managing Internet Identity authentication, exposing identity, login, logout, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for team management, inbox actions, and other backend interactions using an authenticated actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, and base utility classes.",
  "frontend/src/main.tsx": "App entrypoint that mounts React, wrapping the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CreateTeamPage.tsx": "Page for creating a new team, handling form input, optional icon upload, and navigation after creation.",
  "frontend/src/pages/HomePage.tsx": "Home page showing hero content, feature highlights, and navigation to teams or team creation.",
  "frontend/src/pages/InboxPage.tsx": "Inbox page that displays mail, supports reading, deleting, and processing join requests for authenticated users.",
  "frontend/src/pages/LeaderDashboardPage.tsx": "Shows teams led by the signed‑in user, including pending join requests, with states for loading, unauthenticated, and empty teams.",
  "frontend/src/pages/TeamDetailPage.tsx": "Displays full team details, member info, icon and footage uploads, join actions, and leader-only disband controls with loading and not-found handling.",
  "frontend/src/pages/TeamListPage.tsx": "Lists all teams with icons and member counts, including loading and empty states, and links to team detail pages.",
  "frontend/src/utils/imageDataUrl.ts": "Utility for converting image bytes to object URLs or base64 data URLs for display.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, fonts, animations, and plugins for the app’s visual style.",
  "project_state.json": "No summary available."
}