{
  "backend/main.mo": "Main backend actor defining user profiles, teams, mail, access control, and storage logic with permission checks and team membership constraints.",
  "backend/migration.mo": "Migration module that maps old team structures into the new actor format by building a teamMembers index and preserving existing teams.",
  "feature_evidence.json": "Feature evidence report listing updated frontend files, components used, and related test IDs for two team-membership UI features.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files describing their purpose, behavior, and recent feature updates.",
  "frontend/index.css": "Global Tailwind-based styling defining color variables, dark mode values, and shared layout rules.",
  "frontend/index.html": "HTML entry point setting document title and mounting the root React app.",
  "frontend/src/App.tsx": "Top-level React component handling hash routing, authentication state, profile setup modal, and page rendering.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with error handling and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter a name and save their profile via the backend.",
  "frontend/src/components/files/PdfList.tsx": "Empty placeholder file replacing deprecated PDF list functionality.",
  "frontend/src/components/files/PdfUploader.tsx": "Empty placeholder file replacing deprecated PDF upload functionality.",
  "frontend/src/components/layout/AppHeader.tsx": "Header bar showing navigation links, login button, and unread inbox count based on authentication state.",
  "frontend/src/components/layout/PageShell.tsx": "Wrapper layout component that applies max-width styling and optional title/description before rendering children.",
  "frontend/src/components/teams/JoinRequestButton.tsx": "Button component handling all join‑team states including pending, full team, different team, and join requests.",
  "frontend/src/components/teams/TeamFootageGallery.tsx": "Displays team video footage with loading skeletons or an empty state when no videos exist.",
  "frontend/src/components/teams/TeamFootageUploader.tsx": "Video uploader allowing team members to select, validate, preview, and upload footage with progress tracking.",
  "frontend/src/components/teams/TeamIconUploader.tsx": "Image uploader for team icons with validation, preview support, and replace/clear options.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, invalidating related queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Hooks fetching the caller's user profile and role using the current backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including creating AuthClient instances and exposing login state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods related to teams, membership, inbox, and file uploads.",
  "frontend/src/index.css": "Configures Tailwind CSS layers and theme variables for light and dark modes, applying global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CreateTeamPage.tsx": "UI page allowing authenticated users to create a team, upload an icon, and handle related validation and navigation.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying hero content, feature highlights, and navigation actions based on authentication.",
  "frontend/src/pages/InboxPage.tsx": "Inbox interface for viewing, reading, deleting, and responding to mail items, including join request approvals or denials.",
  "frontend/src/pages/LeaderDashboardPage.tsx": "Displays teams led by the authenticated user, showing pending join requests and navigation to team details or creation.",
  "frontend/src/pages/TeamDetailPage.tsx": "Shows detailed team info, member status, icon and footage uploads, and leader actions like disbanding the team.",
  "frontend/src/pages/TeamListPage.tsx": "Lists all teams with icons and member counts, providing navigation to individual team detail pages.",
  "frontend/src/utils/imageDataUrl.ts": "Provides helpers to convert image bytes into blob-based or base64 data URLs for rendering.",
  "frontend/src/utils/urlParams.ts": "Utility functions for retrieving, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "JSON file describing the project’s state, features, constraints, and architectural notes for the Bey Hub X app."
}