{
  "backend/main.mo": "Main actor implementing user profiles with picture/bio, team management with video uploads (including uploader tracking), mail/inbox system, access control via mixins, and migration support for data schema evolution.",
  "backend/migration.mo": "Migration module that transforms old user profiles (name only) to new profiles (name, profilePicture, aboutMe) and old team videos (blob only) to new videos (videoId, blob, uploader).",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: profile page with picture/bio, profile picture uploader, Twitter-style video cards, video delete functionality, and profile navigation link.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, React Query hooks, authentication, responsive layout components, team management pages, and mobile-optimized UI with touch-friendly interactions.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system, dark mode support, tournament-themed purple/blue palette, touch-action optimization, and accessibility features like reduced motion.",
  "frontend/index.html": "HTML entry point with viewport configuration for mobile responsiveness, Open Graph and Twitter Card metadata for social sharing, and root div for React mounting.",
  "frontend/src/App.tsx": "Root React component with hash-based routing for seven pages (home, teams, profile, inbox, etc.), authentication state management, profile setup modal for new users, and theme provider integration.",
  "frontend/src/components/auth/LoginButton.tsx": "Reusable authentication button component that handles Internet Identity login/logout with loading states, query cache clearing on logout, and error recovery for duplicate authentication.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name on first login, using a form with validation and loading states to save the profile via useSaveCallerUserProfile mutation.",
  "frontend/src/components/files/PdfList.tsx": "Empty placeholder file indicating PDF list functionality has been replaced with team footage gallery.",
  "frontend/src/components/files/PdfUploader.tsx": "Empty placeholder file indicating PDF upload functionality has been replaced with team footage uploads.",
  "frontend/src/components/layout/AppHeader.tsx": "Main application header with navigation links (Home, Teams, Create Team, My Teams, Inbox, Profile), mobile menu toggle, login button, and unread inbox badge counter.",
  "frontend/src/components/layout/PageShell.tsx": "Reusable page layout wrapper component that provides consistent max-width container, optional title and description header, and renders children content.",
  "frontend/src/components/profile/ProfilePictureUploader.tsx": "File input component for uploading profile pictures with preview, validation (PNG/JPG/WebP, max 2MB), and conversion to ExternalBlob format for backend storage.",
  "frontend/src/components/teams/JoinRequestButton.tsx": "Button component that handles team join requests with membership status checks, preventing users from joining multiple teams and showing appropriate states (loading, already on team, request sent).",
  "frontend/src/components/teams/TeamFootageGallery.tsx": "Displays a grid of team video footage with delete functionality for team leaders/members, showing video player, uploader avatar, team icon, and empty state when no videos exist.",
  "frontend/src/components/teams/TeamFootageUploader.tsx": "Video file upload component with progress tracking, validation (video formats, max 100MB), and conversion to ExternalBlob for uploading team footage to backend.",
  "frontend/src/components/teams/TeamIconUploader.tsx": "React component for uploading and previewing team icons with file validation (PNG/JPG/WebP, max 2MB), preview display, and error handling.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with authentication, initializes access control with admin token, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Custom React hooks for fetching the current user's profile and role using React Query and the actor instance.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, team operations (create, join, approve requests, leave), and team data fetching with toast notifications for success/error states.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, base styles for smooth scrolling and touch interactions, and utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/CreateTeamPage.tsx": "Page component for creating a new team with name input and optional icon upload, including validation to prevent users from creating multiple teams and navigation after successful creation.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature cards, and call-to-action buttons for browsing teams and creating teams. Displays Beyblade X branding with responsive layout and conditional rendering based on authentication status.",
  "frontend/src/pages/InboxPage.tsx": "Inbox page for viewing and managing mail messages, including join requests with approve/deny actions. Implements mail selection, mark-as-read, and delete functionality with loading and authentication guards.",
  "frontend/src/pages/LeaderDashboardPage.tsx": "Dashboard for team leaders to view and manage their teams and pending join requests. Shows overview of owned teams with member counts and request notifications.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page with view/edit modes for name, about me, and profile picture. Includes profile picture uploader with progress tracking and form validation.",
  "frontend/src/pages/TeamDetailPage.tsx": "Detailed team view page showing team info, members, icon, and footage gallery. Provides leader actions (disband, remove members, upload icon/footage) and member actions (leave, join request).",
  "frontend/src/pages/TeamListPage.tsx": "Grid view of all teams with team icons, member counts, and navigation to detail pages. Includes loading states and empty state with create team prompt.",
  "frontend/src/utils/imageDataUrl.ts": "Utility functions to convert image bytes and content type to data URLs, either as object URLs or base64-encoded data URLs.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting and managing URL parameters from query strings or hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, container settings, border radius variables, font families, and animation keyframes for accordion components.",
  "project_state.json": "Project state tracking document for a social video sharing app, listing existing features (profile pages, profile picture uploads, Twitter-style video cards, video deletion) and pending feature requests."
}