{
  "backend/main.mo": "Main Motoko actor implementing user profiles, team management with videos/files/icons, mail system for join requests, battle requests between teams, and access control with authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: rebranding to 'Bey Hub X', implementing dark/light mode theme system, and replacing the logo with Beyblade X branding.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing components, hooks, pages, and utilities with focus on responsive design, stable callbacks, proper query management, and Bey Hub X branding.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH-based color system defining light and dark mode CSS variables for background, foreground, primary, secondary, accent, destructive, and chart colors.",
  "frontend/index.html": "HTML entry point with 'Bey Hub X' title, meta tags for SEO and social sharing, viewport configuration for mobile responsiveness, and root div for React mounting.",
  "frontend/src/App.tsx": "Main React app with hash-based routing, profile setup modal for new users, authentication state management, and footer with Bey Hub X branding and caffeine.ai attribution.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component using Internet Identity with stable handleAuth callback, query cache clearing on logout, and disabled state during authentication.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for new users to enter their name on first login, with controlled input state and stable handleSave callback using useSaveCallerUserProfile mutation.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches rendering errors and displays a fallback UI with error message, reload button, and home navigation option.",
  "frontend/src/components/files/PdfList.tsx": "Empty placeholder file indicating PDF list functionality has been replaced with team footage gallery.",
  "frontend/src/components/files/PdfUploader.tsx": "Empty placeholder file indicating PDF upload functionality has been replaced with team footage uploads.",
  "frontend/src/components/layout/AppHeader.tsx": "Application header component with navigation menu, authentication controls, theme toggle, and inbox notifications with unread count badge. Includes responsive mobile menu.",
  "frontend/src/components/layout/PageShell.tsx": "Reusable page layout wrapper component that provides consistent container width, optional title/description header, and configurable max-width constraints.",
  "frontend/src/components/profile/ProfilePictureUploader.tsx": "Profile picture upload component with image preview, file validation (PNG/JPG/WebP, max 2MB), and conversion to ExternalBlob format for backend storage.",
  "frontend/src/components/teams/BattleRequestDialog.tsx": "Modal dialog for creating battle requests between teams with date picker for proposing battle dates and submission handling.",
  "frontend/src/components/teams/BattleRequestList.tsx": "Displays incoming pending battle requests for a team with accept/reject actions, showing requesting team name and proposed date.",
  "frontend/src/components/teams/JoinRequestButton.tsx": "Button component for requesting to join a team with validation to prevent joining multiple teams and handling of team capacity limits.",
  "frontend/src/components/teams/ScheduledBattlesList.tsx": "Displays accepted battle requests as scheduled battles for a team, sorted by date with opponent team names and confirmation status.",
  "frontend/src/components/teams/TeamFootageGallery.tsx": "Displays a gallery of team footage videos with delete functionality for team leaders, showing team avatars, video players, and confirmation dialogs for deletion.",
  "frontend/src/components/teams/TeamFootageUploader.tsx": "Provides a file input component for uploading team footage videos with validation (max 100MB), progress tracking, and error handling using ExternalBlob.",
  "frontend/src/components/teams/TeamIconUploader.tsx": "Handles team icon image uploads with preview, validation (PNG/JPG/WebP, max 2MB), and the ability to clear selected images.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Renders a button that toggles between light and dark themes using the useTheme hook.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides React Query hooks to fetch the current user's profile and role from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, teams, team membership, footage management, mail, and battle requests with mutation handling and cache invalidation.",
  "frontend/src/hooks/useTheme.ts": "Custom React hook that manages light/dark theme state, persists preference to localStorage, applies theme class to document root, and checks system preference on initialization.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color tokens for UI components (background, foreground, primary, secondary, etc.) and base styles for HTML elements.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient and InternetIdentityProvider wrappers for state management and authentication.",
  "frontend/src/pages/CreateTeamPage.tsx": "Page component for creating a new Beyblade team with name input and optional icon upload; validates user authentication and existing team membership before allowing team creation.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature cards showcasing team building and video upload capabilities, and navigation buttons to browse or create teams.",
  "frontend/src/pages/InboxPage.tsx": "Inbox page displaying user messages with read/unread status, supporting mail deletion and handling team join request approvals/denials with interactive mail selection.",
  "frontend/src/pages/LeaderDashboardPage.tsx": "Dashboard for team leaders to view their teams, manage join requests, and see battle requests; displays empty state if user has no teams.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page with editable name, about me section, and profile picture upload; displays team membership status and provides options to leave or disband teams for leaders.",
  "frontend/src/pages/TeamDetailPage.tsx": "Displays detailed team information including members, leader status, team icon, footage gallery, battle requests, and scheduled battles. Provides actions for team management (disband, leave, remove members), battle initiation, and file uploads based on user permissions.",
  "frontend/src/pages/TeamListPage.tsx": "Displays a grid of all teams with their icons, names, and member counts. Shows loading skeletons during data fetch and an empty state with a create team button when no teams exist.",
  "frontend/src/utils/imageDataUrl.ts": "Provides utility functions to convert image bytes and content type to data URLs (both object URL and base64 formats) for rendering images in the browser.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom OKLCH-based color system, container settings, extended theme properties (border radius, fonts, animations), and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata for 'Bey Hub X' including completed features (site rebranding, OKLCH color system, logo replacement) and pending feature requests for customizable color schemes and logo implementation."
}