{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add user profile pictures, about me page, video deletion, and Twitter-style video display",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Create a profile page displaying user information including profile picture, username, and about me bio",
      "acceptanceCriteria": [
        "Profile page is accessible via a route (e.g., /profile or /profile/:userId)",
        "Page displays the user's profile picture if available",
        "Page displays the user's about me text",
        "Current user can edit their own profile picture and about me content"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "create",
          "description": "Create a profile page component that displays the current user's profile picture (using ExternalBlob.getDirectURL() if available), username from UserProfile.name, and about me bio from UserProfile.aboutMe. Include an edit mode that allows the user to update their about me text and upload a new profile picture using a ProfilePictureUploader component. Use the useCurrentUser hook to fetch profile data and useQueries hooks for saving profile updates. Wrap content in PageShell component for consistent layout."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new route for '/profile' that renders the ProfilePage component. Import ProfilePage and add it to the existing HashRouter route configuration alongside other pages like HomePage, TeamListPage, etc."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add profile picture upload component that allows users to select and upload images for their profile, similar to TeamIconUploader",
      "acceptanceCriteria": [
        "Component accepts standard image formats (PNG, JPG, WebP)",
        "Shows preview of selected image before upload",
        "Validates file size (max 2MB)",
        "Converts image to Uint8Array and uploads via backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/profile/ProfilePictureUploader.tsx",
          "operation": "create",
          "description": "Create a profile picture uploader component following the same pattern as TeamIconUploader. Accept image files (PNG, JPG, WebP), validate file size (max 2MB), show preview of selected image, and provide a callback with the ExternalBlob created from the selected file bytes. Include file input, preview display with circular avatar styling, clear button, and validation error messages. Use ExternalBlob.fromBytes() to convert the selected image data."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Display team footage videos in Twitter-style card format with poster's profile picture and team icon to the left of the video",
      "acceptanceCriteria": [
        "Video cards show the uploader's profile picture on the left side",
        "Video cards show the team icon on the left side",
        "Layout resembles Twitter's tweet card design with media on the right",
        "Video cards display the uploader's username",
        "Cards are styled consistently with the rest of the app's theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/teams/TeamFootageGallery.tsx",
          "operation": "modify",
          "description": "Replace the current grid layout with a Twitter-style card layout. For each video, create a card with a left column containing the uploader's profile picture (circular avatar) and team icon stacked vertically, and a right column containing the video player and uploader's username above it. Fetch uploader profile information for each video (backend would need to track video uploader, but frontend should handle gracefully if unavailable). Use flex layout with gap spacing. Style cards with borders, padding, and hover effects consistent with the app theme."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add delete button to video cards that allows the video uploader or team leader to remove videos",
      "acceptanceCriteria": [
        "Delete button appears only for authorized users (uploader or team leader)",
        "Clicking delete shows a confirmation dialog",
        "Successful deletion removes the video from the display",
        "Error messages are shown if deletion fails"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new mutation hook useDeleteTeamFootage that calls actor.deleteTeamFootage(teamId, videoId). Include success toast notification, error handling with toast, and automatic refetch of team footage query on success. Follow the same pattern as other mutation hooks in the file."
        },
        {
          "path": "frontend/src/components/teams/TeamFootageGallery.tsx",
          "operation": "modify",
          "description": "Add a delete button to each video card that appears only when the current user is the video uploader or team leader (compare using identity.getPrincipal().toString() similar to TeamDetailPage member checks). When clicked, show a confirmation dialog using window.confirm or a custom modal. On confirmation, call the useDeleteTeamFootage mutation with the video ID. Display loading state during deletion and show error/success feedback. Note: Backend needs to track video uploader principal and return it with video data for proper authorization checks."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Update AppHeader navigation to include a link to the user's profile page",
      "acceptanceCriteria": [
        "Profile link appears in the navigation menu when user is authenticated",
        "Link routes to the current user's profile page",
        "Mobile menu includes the profile link"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppHeader.tsx",
          "operation": "modify",
          "description": "Add a 'Profile' navigation link that routes to '/profile' in both the desktop navigation menu (between existing links) and the mobile menu. Show the link only when the user is authenticated (when identity exists). Use the same styling pattern as existing navigation links with hover effects and active state indicators."
        }
      ]
    }
  ]
}